////////ß////////////加速度について//////////////////////////
var aX = 0, aY = 0, aZ = 0;                     // 加速度の値を入れる変数を3個用意
var realX = [], realY = [], realZ = [], imaginaryX = [], imaginaryY = [], imaginaryZ = [];
var fftX = new FFT();
var fftY = new FFT();
var fftZ = new FFT();
    
window.addEventListener("devicemotion", (dat) => {
    var ua = [
		"iPod",
		"iPad",
		"iPhone",
		"Android"
    ]
	
	for (var i = 0; i < ua.length; i++) {
		if (navigator.userAgent.indexOf(ua[i]) > 0) {
            aX = -dat.accelerationIncludingGravity.x;    // x軸の重力加速度（Android と iOSでは正負が逆）
            aY = -dat.accelerationIncludingGravity.y;    // y軸の重力加速度（Android と iOSでは正負が逆）
            aZ = -dat.accelerationIncludingGravity.z;    // z軸の重力加速度（Android と iOSでは正負が逆）
            break;
		}
	}
    aX = dat.accelerationIncludingGravity.x;    // x軸の重力加速度（Android と iOSでは正負が逆）
    aY = dat.accelerationIncludingGravity.y;    // y軸の重力加速度（Android と iOSでは正負が逆）
    aZ = dat.accelerationIncludingGravity.z;    // z軸の重力加速度（Android と iOSでは正負が逆）
});
 
// 指定時間ごとに繰り返し実行される setInterval(実行する内容, 間隔[ms]) タイマーを設定
var timer = window.setInterval(() => {
    displayData();      // displayData 関数を実行
}, 100); // 33msごとに（1秒間に約100回）
 
// データを表示する displayData 関数
function displayData() {
    var txt = document.getElementById("txt");   // データを表示するdiv要素の取得
    txt.innerHTML = "x: " + aX + "<br>"         // x軸の値
                  + "y: " + aY + "<br>"         // y軸の値
                  + "z: " + aZ;                 // z軸の値
}

document.getElementById("result").innerHTML = getUserType()

function getUserType() {
	var ua = [
		"iPod",
		"iPad",
		"iPhone",
		"Android"
    ]

	
	for (var i = 0; i < ua.length; i++) {
		if (navigator.userAgent.indexOf(ua[i]) > 0) {
			return ua[i]
		}
	}
	return "Other"
}

ctx = document.getElementById("canvasX").getContext("2d");
myBar = new Chart(ctx, {
    type: 'line', 
    fill: false,
    data: {
        datasets: [
            {
                label: 'X軸方向成分の加速度',
                fill: false,
                borderColor : "rgba(254,97,132,0.8)"
            }
        ],
    },
    options: {
        title: {                           //タイトル設定
            display: true,                 //表示設定
            fontSize: 18,                  //フォントサイズ
            text: 'X軸方向成分の加速度'                //ラベル
        },
        scales: {
            yAxes: [                          
                {
                    ticks: {                       
                        min: -10,                      
                        max: 10                 
                    }
                }
            ],
            yAxes: [{                      //y軸設定
                display: true,             //表示設定
                scaleLabel: {              //軸ラベル設定
                   display: true,          //表示設定
                   labelString: '加速度(m/s^2)',  //ラベル
                   fontSize: 18               //フォントサイズ
                },
            }],
            xAxes: [{ 
                display: true,                //表示設定
                    scaleLabel: {                 //軸ラベル設定
                       display: true,             //表示設定
                       labelString: '秒(s)',  //ラベル
                       fontSize: 18               //フォントサイズ
                    },                         
                type: 'realtime',  
                realtime: {         
                    duration: 4000,      
                    refresh: 200,    
                    delay: 1000,   
                    pause: false, 

                    onRefresh: function(chart) {
                        chart.data.datasets[0].data.push({
                            //グラフにデータを追加
                            x: Date.now(),
                            y: get_data1()
                        })
                        realX.push(get_data1());
                        imaginaryX = new Array(realX.length);
                        imaginaryX.fill(0);
                        originalX = realX.slice(0);   
                    }
                }
            }]
        },
        plugins: {
            streaming: {      
                frameRate: 30
            }
        }
    }
});
cty = document.getElementById("canvasY").getContext("2d");
myBar = new Chart(cty, {
    type: 'line', 
    fill: false,
    data: {
        datasets: [
            {
                label: 'Y軸方向成分の加速度',
                fill: false,
                borderColor : "rgba(54,164,235,0.8)"
            }
        ],
    },
    options: {
        title: {                           //タイトル設定
            display: true,                 //表示設定
            fontSize: 18,                  //フォントサイズ
            text: 'Y軸方向成分の加速度'                //ラベル
        },
        scales: {
            yAxes: [                          
                {
                    ticks: {                       
                        min: -10,                      
                        max: 10                 
                    }
                }
            ],
            yAxes: [{                      //y軸設定
                display: true,             //表示設定
                scaleLabel: {              //軸ラベル設定
                   display: true,          //表示設定
                   labelString: '加速度(m/s^2)',  //ラベル
                   fontSize: 18               //フォントサイズ
                },
            }],
            xAxes: [{ 
                display: true,                //表示設定
                    scaleLabel: {                 //軸ラベル設定
                       display: true,             //表示設定
                       labelString: '秒(s)',  //ラベル
                       fontSize: 18               //フォントサイズ
                    },                        
                type: 'realtime',  
                realtime: {         
                    duration: 4000,      
                    refresh: 200,    
                    delay: 1000,   
                    pause: false, 

                    onRefresh: function(chart) {
                        chart.data.datasets[0].data.push({
                            //グラフにデータを追加
                            x: Date.now(),
                            y: get_data2()
                        })
                        realY.push(get_data2());
                        imaginaryY = new Array(realY.length);
                        imaginaryY.fill(0);
                        originalY = realY.slice(0);   
                    }
                }
            }]
        },
        plugins: {
            streaming: {      
                frameRate: 30
            }
        }
    }
});
ctz = document.getElementById("canvasZ").getContext("2d");
myBar = new Chart(ctz, {
    type: 'line', 
    fill: false,
    data: {
        datasets: [
            {
                label: 'Z軸方向成分の加速度',
                fill: false,
                borderColor : "rgba(255,255,0,0.8)"
            },
        ],
    },
    options: {
        title: {                           //タイトル設定
            display: true,                 //表示設定
            fontSize: 18,                  //フォントサイズ
            text: 'Z軸方向成分の加速度'                //ラベル
        },
        scales: {
            yAxes: [                          
                {
                    ticks: {                       
                        min: -10,                      
                        max: 15                 
                    }
                }
            ],
            yAxes: [{                      //y軸設定
                display: true,             //表示設定
                scaleLabel: {              //軸ラベル設定
                   display: true,          //表示設定
                   labelString: '加速度(m/s^2)',  //ラベル
                   fontSize: 18               //フォントサイズ
                },
            }],
            xAxes: [{ 
                display: true,                //表示設定
                    scaleLabel: {                 //軸ラベル設定
                       display: true,             //表示設定
                       labelString: '秒(s)',  //ラベル
                       fontSize: 18               //フォントサイズ
                    },                          
                type: 'realtime',  
                realtime: {         
                    duration: 4000,      
                    refresh: 200,    
                    delay: 1000, 
                    pause: false, 

                    onRefresh: function(chart) {
                        chart.data.datasets[0].data.push({
                            //グラフにデータを追加
                            x: Date.now(),
                            y: get_data3()
                        })
                        // realZ.push(get_data3());
                        // imaginaryZ = new Array(realZ.length);
                        // imaginaryZ.fill(0);
                        // originalZ = realZ.slice(0);   
                    }
                }
            }]
        },
        plugins: {
            streaming: {      
                frameRate: 30
            }
        }
    }
});


var count = 0;
function get_data1() {
    return aX;
}
function get_data2() {
    return aY;
}
function get_data3() {
    return aZ;
}


/////////////////////////////////////////////////////////
function out(array){
    $("#console").html( $("#console").html() +"<br/><br/>" +  JSON.stringify(array)  );

}
document.getElementById("finishbtn").onclick = function(){
    realZ = [4.1422309875488,        4.6539115905761,        2.3253870010375,        1.2293071746826, -0.307415962,        -2.130923748,-3.139079094,        -3.064038277,        -0.468729973,        2.81086731,        4.224456787,        5.495201111,        3.60188961,        1.210383415,        -0.408725739,        -2.049293041, -3.279249668,        -3.402252197,        -0.992930412,        2.283098221,        4.413666725,        5.533863068,        3.447195053,        2.304048538,        -1.150849819,        -2.225511074,        -3.412330151,        -3.910607338,       -0.871486664,        2.098926544,        3.657567024,        5.455742836,        3.899579048,        2.167668343,        -0.548811913,        -2.410852909,        -2.728208065,        -1.070350647,        0.070331573,        2.380959511,        5.258289337,        5.477473259,        2.052794456,        1.287858963,        -0.225624084,        -1.52967453,        -2.850824833,        -2.864587784,        -0.072032928,        1.283950806,        3.437111855,        4.636330605,        3.335249901,        2.353860855,        0.133800507,        -1.691135406,        -2.714611053,        -3.764240742,        0.259875298,        1.256748199,        3.844290733,        3.993879318,        4.426537514,        2.453317642,        0.80851841,        -1.54352951,        -1.713543892,        -2.930914402,        -0.482935905,        -0.114424706,        3.25078392,        4.704756737,        3.866749763,        1.98019886,        1.299213409,        -0.907291412,        -1.709882736,        -3.420339108,       -1.660141468,        0.556293488,        3.40116024,        4.474219322,        5.08847332,        2.240415573,        1.505293846,        -1.473444462,        -1.983990669,        -3.142165661,        -0.521378517,        -0.667889595,        4.719812393,        6.437479019,        2.422019958,        1.908998489,        0.645605087,        -1.169340134,        -2.021870136,        -3.298032761,        -0.370622635,        0.687108994,        3.20507431,        4.263758659,        5.018666267,        2.046699524,        1.511789322,        -1.800960541,        -2.051755905,        -4.078504562,        -0.596106529,        1.162258148,        2.898888588,        4.166293144,        5.349054337,        3.348391533,        1.321581841,        -0.110117912,        -1.980492115,        -3.237363815,       -2.254412651,        0.711104393,        1.486286163,        5.117705345,        5.754293442,        2.418099403,        1.875642776,        -1.54418993,        -2.591551304,        -3.765771866,        -1.584124565,        0.773828506,        4.150453568,        4.575756073,        4.97136879,        2.395154953,        0.414897919,        -2.92400074,        -3.340204716,        -2.10854578,        -0.032607079,        0.797593117,        5.642053604,        5.860548973,        3.112154961,        0.881000519,        -0.850435257,        -2.269867897,        -3.396119118,        -1.846278667,        0.479198456,        3.78137207,        5.437169075,        3.497719765,        2.208455086,        0.933065414,        -0.980823517,        -2.934811115,        -2.660343647,        -2.203722477,        0.467204094,        2.588238716,        4.719983101,        4.54066658,        2.900286674,        1.659230232,        -0.195382118,        -2.215978146,        -3.110340595,        -1.965716362,        -0.86090374,        3.488430977,        6.779844284,        5.377512932,        2.705086708,        1.526891708,        -0.209819794,        -2.256139278,        -3.412771225,        -2.889689922,        -0.444564819,        1.996823311,        4.557941437,        5.41063118,        2.629825592,        1.816113472,        -0.62448597,        -1.176227093,        -2.631432056,        -3.186136246,       -0.748324394,        1.232476234,        5.783660889,        5.717212677,        1.55331707,        1.627480507,        0.465510368,        -1.946218491,        -3.002811909,        -4.254778385,        -0.048810959,        1.540266037,        3.994288445,        4.352384567,        3.589062691,        1.40602684,        0.377264023,        -1.545053005,        -2.430080891,        -3.794439316,        -0.815215111,        1.271882057,        3.171256065,        6.283226967,        4.667817116,        1.148543358,        0.231355667,        -0.98401165,        -2.4732728,        -3.76680851,        -0.42182827,        1.357428551,        2.640476227,        4.035849571,        4.69753933,        3.438217163,        1.702449799,        -1.230181217,        -2.905222416,        -3.405950546,        -0.873848915,       0.22287941,        2.055977821,        3.651234627,        5.663094521,        2.506746292,        0.276148796,        -1.07347393,        -2.649389744,        -3.655247688,        0.632600784,        -0.382850647,        1.07034111,        3.86656189,        6.032374382,        2.483556747,        1.642142296,        0.554064751,        -1.515990734,        -2.153176785,        -3.705668926,        -0.152380943,        2.771369934,        3.41039753,        5.036129951,        2.608703613,        1.577059746,        -0.85724926,        -2.354449272,        -3.123687744,        -1.999258041,        -0.040739059,        1.736189842,        4.32459259,        5.608060837,        2.292275429,        2.208477974,        -0.156377792,        -2.534977913,        -3.88531065,        -1.235919476,        0.659793854,        2.799189568,        4.501813889,        4.999909401,        2.6388731,        1.515625,        -0.834889412,        -2.541793823,        -3.104275703,        -2.357793331,        -0.231455803,        2.073107719,       4.699987411,        3.857507706,        2.129944801,        2.004357338,        -0.120223999,        -1.515380859,        -3.307919025,        -2.944813728,        -1.11015892,        1.334319115,        3.847179413,        5.152565002,        3.455488205,        1.771121025,        0.586168289,        -1.184374809,        -3.296145439,        -3.124184132,        -0.233656883,        2.203310013,        3.974373817,        5.481635094,        2.699519157,        1.554745674,        0.086090088,        -1.247984409,        -2.487808704,        -3.872513294,        -1.431533813,        0.801104546,        4.221704483,        5.75971508,        4.156902313,        1.312661171,        -0.373574257,        -2.6242342,        -3.880932331,        -3.099412441,        -0.809252739,        2.986358643,        5.582549095,        6.532787323,        2.543964386,        0.589899063,        -1.375009537,        -2.948374271,        -4.977285385,        -1.004128933,       0.242816925,        3.945756912,        7.265712738,        3.540509224,        1.612835884,        -0.749651909,        -1.636077404,        -2.992844582,        -2.353747845,        -0.396594048,        1.069280624,        3.581903458,        6.069200516,        3.764493942,        1.446505547,        0.429078102,        -2.033814907,        -2.719344616,        -1.378403664,        -0.320833206,        2.076973915,        3.237112999,        4.128153801,        3.74352169,        2.266544342,        1.239395142,        -0.987229347,        -1.999507904,        -3.806904793,        -1.71716404,        -1.446473598,        3.649701118,       6.204612732,        5.035118103,        2.105674744,        1.565890312,        -0.940608025,        -2.517753601,        -3.745371819,        -2.088018894,        -0.817616463,        1.018576622,        4.533434868,        6.05979538,        3.155797958,        1.415403366,        0.472911835,        -2.795841694,        -2.789777279,        -1.482946396,       -1.790521622,        -0.031559944,        5.782124519,        6.112048149,        2.678975105,        2.025034904,        0.415431023,        -0.841814041,        -1.900994301,        -3.84953022,        -2.525242329,        0.169558525,        1.985553741,        4.627964973,        6.257368088,        2.535606384,        1.18854332,        -0.26950264,        -2.707546234,       -4.15831995,        -1.461192131,        -1.181873798,        4.481420517,        5.738904953,        4.228522301,        3.305547714,        0.275689125,        -1.134325981,        -2.970837593,-3.867350101,        -4.15636158,        0.38937664,        3.005772591,        4.208403587,        4.809996605,        2.555333138,        1.596459389,        -0.834289551,        -1.035308838,        -2.363587856,        -4.583494186,        -1.174670696,        0.334376335,        3.447816849,        6.299231529,        4.820865631,        3.285159111,        0.415937424,        -0.315957069,        -2.835000515,        -4.626594067,        -1.880944729,        -0.41472435,        3.941807747,        5.014461517,        4.893995285,        3.559158325,        1.962452888,        -1.014098644,        -4.017641544,        -5.256862879,      -1.163981915,        2.15533638,        3.986617088,        6.217073441,        3.466371536,        2.913371086,        -0.31420517,        -2.125677109,        -4.101984501,        -4.3234725,        -1.237886906,        1.677306175,        5.075435638,        5.806235313,        3.07186985,        2.465210915,       1.205888748,        -1.514828682,      -3.283661842,        -4.629351139,        -1.277347088,        1.912617683,        3.953966141,        5.674411774,        3.414589882,        1.476821899,        0.750360489,        -1.015792847,       -2.314888477,        -4.135379791,        -1.465656281,        0.392113686,        2.579421043,        4.326148987,        4.518726349,        2.529495239,        1.892089844,        -0.187701225,        -1.702009678,        -4.004621506,        -2.737766743,        -0.729689598,        3.240707397,        6.386751175,        3.52555275,        2.532049179,        0.500084877,        -2.099136829,        -3.24823904,        -4.834299564,        -0.358620644,        1.284610748,        5.492611885,        5.49256897,        3.122670174,        1.764549255,        0.613478661,        -1.294631004,        -3.123732567,        -4.184297562,        -0.935995102,        0.970031738,        2.322424889,        3.892608643,        4.760596275,        3.452528954,        2.051171303,        -0.020545959,        -2.53512907,        -3.593265057,        -2.998530388,        -0.787407875,        2.594061852,        4.878293991,        4.71271801,        4.456362724,        2.537442207,        0.272589684,        -2.171238899,        -3.844517231,        -4.329739094,        -0.75385952,        1.427707672,        5.466409683,        5.183339119,        2.217964172,        0.743192673,        -0.686264038,        -0.918868065,        0.016163826,        0.685347557,]
    imaginaryZ = new Array(realZ.length);
    imaginaryZ.fill(0);
    originalZ = realZ.slice(0);  
        console.log(realZ)
    fftZ.calc(1, realZ, imaginaryZ)
    var phase = fftZ.phase(realZ, imaginaryZ);
    var frequencies = fftZ.frequencies(realZ, imaginaryZ, 10); //周波数
    var amplitude = fftZ.amplitude(realZ, imaginaryZ); //振幅
    var periods = fftZ.periods(realZ, imaginaryZ, 1);
    console.log(frequencies)
    console.log(amplitude)
    ctbar = document.getElementById("result").getContext("2d");
    myBar = new Chart(ctbar, {
        type: "line",    // ★必須　グラフの種類
        data: {
            labels:  frequencies,  // Ｘ軸のラベル
            datasets: [
                {
                    label: "FFT",                            // 系列名
                    data: amplitude                   // ★必須　系列Ａのデータ
                }
            ]
        }
});

        fftX.calc( -1, realZ, imaginaryZ);
    
        console.timeEnd('fft');
    var txt = document.getElementById("console");  
    txt.innerHTML = "real: " + realZ + "<br>"       
                  + "imaginary: " + imaginaryZ ;
}

